/*Од стандарден влез се вчитуваaт три броја кои ги означуваат времињата (во минути) со кои три натпреварувачи истрчале 5км на Скопскиот маратон. 
Да се испечати редниот број на најбрзиот натпреварувач. Доколку најбрзо време имаат повеќе од еден натпреварувач, се печатат редните броеви на сите такви натпреварувачи.
*/

#include <stdio.h>
int main()
{
    float a, b, c;
    scanf("%f%f%f",&a, &b, &c);
    if(a<b&&a<c){
    printf("1");}
    else if(b<a&&b<c){
        printf("2");
    }
    else if(c<a&&c<b){
        printf("3");
    }
    else{
    if(a==b && b==c){
        printf("123");
    }
    else if(a==c){
        printf("13");
    }
    else if(b==c){
        printf("23");
    }
    else if(a==b){
        printf("12");
    }
    }
    return 0;
}
