/*Во рамките на текстуална датотека matrica.txt се сместени елементите (целобројни вредности) од една матрица (A). Во првиот ред од датотеката се запишани бројот на редици n и бројот на колони m на матрицата (n, m < 120). Потоа, во секој ред од датотеката се запишани елементите од соодветната редица на матрицата.

Да се испечати колку индексни броеви има во секоја колона поединечно.

Индексен број е број чија вредност е идентична со вредноста што се добива со спојување на индексот од редицата и колоната на елементот.


Помош:

Индексен елемент: вредноста на елементот Aij е иста со ij како број
- ако i=10, j=31, елементот Aij треба да има вредност 1031 за да биде индексен број


Пример:

Влез: // датотека matrica.txt

4  5

0    1    2    3    4

5    6    7    8    9

10  21  22  23  11
0    1    2    33    4


Излез:

1

2

2

3

1


Објаснување:

Во матрицата A индексни елементи се: 

1ва колона: 0

2ра колона: 1, 21

3та колона: 2, 22

4та колона: 3, 23, 33

5та колона: 4*/

#include<stdio.h>
#include<ctype.h>
#include<string.h>

void wtf() {
    FILE *f = fopen("matrica.txt", "w");
    char c;
    while((c = getchar()) != '#') {
        fputc(c, f);
    }
    fclose(f);
}

int main() {
    wtf();
    FILE *f = fopen("matrica.txt", "r");
    int m, n, i, j, a[120][120],counter=0,temp;
    fscanf(f,"%d",&m);
    fscanf(f,"%d",&n);
    for(i=0;i<m;i++){
        for(j=0;j<n;j++){
        fscanf(f,"%d",&a[i][j]);
        }
    }
    for(j=0;j<n;j++){
        counter=0;
        for(i=0;i<m;i++){
            if(j<10){
        if(a[i][j]==i*10+j){
            counter++;
        }
            }
        if(j>=10&&j<100){
            if(a[i][j]==i*100+j){
            counter++;
        }
        }
        if(j>=100){
            if(a[i][j]==i*1000+j){
            counter++;
        }
        }
        }
        printf("%d\n",counter);
    }
    fclose(f);
    return 0;
}
