/*Од тастатура се читаат непознат број на позитивни цели броеви (со максимум 5 цифри) се додека не се внесе нешто различно од број.
За секој број треба да се најде позицијата (од десно на лево) на првото појавување на најголемата цифра во составот на бројот
(цифрата на единици се наоѓа на позиција 0).
Потоа, да се испечати статистика за позициите на најдените цифри со максимална вредност во следниот формат:
[позиција]: [вкупно броеви чија максимална цифра се наоѓа на таа позиција]

0: 2
1: 3
2: 1
3: 1
4: 1
за броевите 97654 48654 12345 12343 1263 12443 12643 12777*/

#include<stdio.h>
int main(){
    int a;
    int num0,num1,num2,num3,num4;
    int c0=0,c1=0,c2=0,c3=0,c4=0;
    while(scanf("%d",&a)) {
        num0 = a % 10;
        num1 = (a % 100) / 10;
        num2 = (a / 100) % 10;
        num3 = (a / 1000) % 10;
        num4 = (a / 10000);
        if (num0 >= num1 && num0 >= num2 && num0 >= num3 && num0 >= num4) {
            c0++;
        }else if (num1 >= num0 && num1 >= num2 && num1 >= num3 && num1 >= num4){
            c1++;
        }else if (num2 >= num0 && num2 >= num1 && num2 >= num3 && num2 >= num4){
            c2++;
        }else if (num3 >= num0 && num3 >= num1 && num3 >= num2 && num3 >= num4){
            c3++;
        }else if (num4 >= num0 && num4 >= num1 && num4 >= num2 && num4 >= num3){
            c4++;
        }
    }
    printf("0: %d\n",c0);
    printf("1: %d\n",c1);
    printf("2: %d\n",c2);
    printf("3: %d\n",c3);
    printf("4: %d\n",c4);
    return 0;
}
