/*Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.
Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, 
во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.
Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)*/

#include <stdio.h>
int main(){

    int a, b, temp=0, flag=0;
    scanf("%d %d", &a, &b);
    if(a<=0 || b<=0){
        flag=1000;
    }
    else {
        if(a>b) { //true
            temp = b;  //temp = 1357
            while (temp > 0) //true
                if (temp % 10 == (a / 10) % 10) //temp=7==a=7
                {
                    temp /= 10; //135
                    a /= 100; //123456
        }else {
                    flag=1;
                    break;}
        } else {
            temp=a;
            while(temp>0)
                if(temp%10==(b/10)%10){
                    temp/=10;
                    b/=100;}
                else {
                    flag=1;
                    break;}
        }
    }
    if(flag==1000)
        printf("Invalid input");
    else if(flag==1)
        printf("NE");
    else printf("PAREN");
    return 0;
}
