/*Од тастатура се внесуваат цели броеви се додека не се внесе нешто што не е цел број.
Да се испечати на екран сумата на броевите во кои цифрите се подредени во опаѓачки редослед. Доколку нема такви броеви, да се испечати порака NEMA.
Објаснување на примерот:
Во првиот пример, нема ниту еден број во кој цифрите се подредени во опаѓачки редослед, па се печати NEMA.
Во вториот пример, во 4321, 21 и 81, цифрите се подредени во опаѓачки редослед, па се печати нивната сума 4423.*/

#include<stdio.h>
int main () {
int sum=0,n,pc,m, flag;
while (scanf("%d",&n)){
    m=n; 
    flag=0;
    while(n>9) {
        pc=n%10;
        n/=10;
        if(pc>=n%10) {
            flag=1;
            break;
        }
    }
    if(flag==0) sum+=m; 
}
if (sum==0) printf("NEMA");
else printf("%d",sum);
return 0;
}
