/*Од стандарден влез се чита број x. 
На екран да се испечати 1 ако бројот x x∈(−100,100)∪[200,300)
, a 0 во спротивно.
Задачата да се реши со логички операции (без if-else). */

#include <stdio.h>
int main() {
int a;
scanf("%d",&a);
    int br=0;
    br= a>-100 && a<100 || a>=200 && a<300;
    printf("%d", br);
    return 0;
}
