/*Полу-елка се црта со ѕвездички (*) и прачки (|) на следниот начин:
*
|
|**
|
|***
|
|****
Значи, во првиот ред има ѕвездичка. Во следниот ред има прачка. Понатаму преку еден ред имаме или само прачка или прачка со неколку ѕвездички (една повеќе отколку во прет-претходниот ред). Полу-елката завршува со ред во кој има една прачка и N ѕвездички.
За дадено N, отпечатете ја полу-елката според описот.
За N=4, треба на излез да се добие како примерот погоре.*/

#include <stdio.h>
int main()
{
    int brDzv, brojac=0, pocetDzv=2, i;
    scanf("%d",&brDzv);
    printf("*\n");
    if(brDzv!=1){
    while(1){
        printf("|");
        if(brojac%2!=0){
        for(i=0;i<pocetDzv;i++)
        printf("*");
            pocetDzv++;
        }
        if(pocetDzv==brDzv+1)
        break;
    brojac++;
    printf("\n");}}
    return 0;
}
