/*Од стандарден влез се внесува број n (димензии за квадратна матрица). Потоа се внесува матрицата. Да се трансформира матрицата така што секој елемент кој се наоѓа во исто време под главната и споредната дијагонала во обратен број. Обратен број на некој број е ако тој е позитивен да се претвори во негативен број, а ако бројот е негативен да се претвори во позитивен број.
Објаснување за првиот тест пример броевите што се задебелени се наоѓаат под главната и споредната дијагонала.
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5*/

#include <stdio.h>
int main()
{
   int a[100][100], i, j, m, n;
   scanf("%d",&n);
   for(i=0;i<n;i++){
       for(j=0;j<n;j++){
       scanf("%d", &a[i][j]);
   }
   }
   for(i=0;i<n;i++){
       for(j=0;j<n;j++){
           if(i>j&&i+j>=n){
               a[i][j]*=-1;
           }
       }
   }
       for(i=0;i<n;i++){
       for(j=0;j<n;j++){
           printf("%d ",a[i][j]);
       }
    printf("\n");      
       }
    return 0;
}
