/*Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви). Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:

    Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
    Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
    Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0

Променетата матрица да се испечати на екран.
*/

#include<stdio.h>
int main()
{
    int a[100][100],m,zbir=0, br, n, i, j, x;
    scanf("%d",&x);
    scanf("%d%d",&m,&n);
    for(i=0;i<m;i++){
        for(j=0;j<n;j++){
            scanf("%d",&a[i][j]);
        }
    }
    for(i=0;i<m;i++){
        for(j=0;j<n;j++) {
            zbir += a[i][j];
            br = j;
            while (br >= 0) {
                if (zbir > x) {
                    a[i][br] = 1;
                }
                if (zbir < x) {
                    a[i][br] = -1;
                }
                if(zbir==x){
                    a[i][br] = 0;
                }
                br--;
            }
        }
        zbir=0;
    }
    for(i=0;i<m;i++){
        for(j=0;j<n;j++){
            printf("%d ",a[i][j]);
        }
        printf("\n");
    }
    return 0;
}
