/*Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).

Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.

Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.*/

#include<stdio.h>
int main(){
    int a[100][100], i, j, m, n, ind1, ind2,zbir1=0,zbir2=0,zbir3=0,zbir4=0;
    scanf("%d%d",&m,&n);
    for(i=0;i<m;i++){
        for(j=0;j<n;j++){
            scanf("%d",&a[i][j]);
        }
    }
    scanf("%d%d",&ind1,&ind2);
    for(i=0;i<m;i++) {
        for (j = 0; j < n; j++) {
            if (i >= ind1) {
                if (j < ind2) {
                    zbir3 += a[i][j];
                } else if (j >= ind2) {
                    zbir4 += a[i][j];
                }
            }
            if (i < ind1) {
                if (j >= ind2) {
                    zbir1 += a[i][j];
                } else if (j < ind2) {
                    zbir2 += a[i][j];
                }
            }
        }
    }
    printf("%d %d %d %d",zbir1,zbir2,zbir3,zbir4);
    return 0;
}
