/*Да се напише програма која вчитува матрица со димензии MxN (макс. 100x100). На почетокот се внесуваат димензиите на матрицата, а потоа и елементите на матрицата кои се само вредностите 1 и 0. Програмата треба да изброи и отпечати на СИ во колку од редиците и колоните има барем 3 последователни елементи со вредност 1.

Пример:
1110
1011
1001
 
1 ред + 1 колона = 2*/

#include <stdio.h>
int main() {
    int m,n,i,j;
    scanf("%d%d",&m,&n);
    int a[100][100];
    for(i=0; i<m; i++)
        for(j=0; j<n; j++)
            scanf("%d",&a[i][j]);
    int br=0;
    for(i=0; i<m; i++) {
        for(j=0; j<n-2; j++)
            if(a[i][j]==1&&a[i][j+1]==1&&a[i][j+2]==1) {
                br++;
                break;
            }
    }
    for(j=0; j<n; j++)
        for(i=0; i<m-2; i++)
            if(a[i][j]==1&&a[i+1][j]==1&&a[i+2][j]) {
                br++;
                break;
            }
    printf("%d",br);
    return 0;
}
